Repository: lang-uk/translation-metrics
Catalog: data/17099743/Animal_farm_combine.tmx
Source language: en_1945_george_orwell_animal_farm
Languages: uk_1984_iryna_dybko_khutir_tvaryn, uk_1991_yurii_shevchuk_ferma_rai_dlia_tv, uk_2020_bohdana_nosenok_kolhosp_tvaryn

source: ‘Forward, comrades!’ he whispered. ‘Forward in the name of the Rebellion.
uk_1984_iryna_dybko_khutir_tvaryn: — «Вперед, товариші! Вперед, в ім’я революції!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: «Уперед, товариші! — шепотів він. — Уперед в ім'я Повстання.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: «Уперед, товариші! — шепотів він мені. — Вперед, в ім’я Повстання.

source: Long live Animal Farm! Long live Comrade Napoleon!
uk_1984_iryna_dybko_khutir_tvaryn: Хай живе товариш Вісарйонов, наш великий вождь!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Хай живе «Рай для Тварин»! Хай живе товариш Наполеон!
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Хай живе „Колгосп тварин”! Хай живе товариш Наполеон!

source: Napoleon is always right.’
uk_1984_iryna_dybko_khutir_tvaryn: За Вісарйоновим завжди правда!»
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Наполеон завжди правий!».
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Наполеон завжди правий».

source: Those were his very last words, comrades.”
uk_1984_iryna_dybko_khutir_tvaryn: [Його ж останніми словами при кінці життя були]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Отакі були його останні слова, товариші.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Це були його останні слова, товариші.

source: Here Squealer’s demeanour suddenly changed. He fell silent for a moment, and his little eyes darted suspicious glances from side to side before he proceeded.
uk_1984_iryna_dybko_khutir_tvaryn: Нікітов замовк і проникливо позирав на кожну тварину, а тоді почав розмову на іншу тему:
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тут Пищик несподівано вмовк і підозріло заозирався на всі боки.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Тут Пискун раптом урвав розповідь і підозріло роззирнувся.

source: It had come to his knowledge, he said, that a foolish and wicked rumour had been circulated at the time of Boxer’s removal.
uk_1984_iryna_dybko_khutir_tvaryn: — Дійшли до мене, товариші, чутки,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Він прочув, повів він далі, що коли Боксера забирали, ширилися безглузді й злісні чутки.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Потім сказав, що до нього дійшла химерна чутка,

source: Some of the animals had noticed that the van which took Boxer away was marked “Horse Slaughterer,” and had actually jumped to the conclusion that Boxer was being sent to the knacker’s.
uk_1984_iryna_dybko_khutir_tvaryn: що дехто з вас неправильно думав, начебто Добрилова взяли до різні. Хтось бо з вас запримітив отой напис на возі, в якому повезли Добрилова.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Бо дехто помітив на фургоні, яким відвозили Боксера, слово «Коновал». І поквапливо виснував, що Боксера відправляють до шкуродерні.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: ніби хтось помітив, що на фургоні було написано «Живодер», після чого той дійшов легковажного висновку, що Боксера відвезли на бійню.

source: It was almost unbelievable, said Squealer, that any animal could be so stupid.
uk_1984_iryna_dybko_khutir_tvaryn: [Просто важко повірити, що між вами є ще такі нерозумні!]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тяжко повірити, зітхнув Пищик, щоб хтось із тварин докотився до такого.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Важко повірити, — скрушно хитаючи головою, сказав Пискун, — що хтось із тварин міг припустити таку дурість.

source: Surely, he cried indignantly, whisking his tail and skipping from side to side, surely they knew their beloved Leader, Comrade Napoleon, better than that?
uk_1984_iryna_dybko_khutir_tvaryn: [Як можна сумніватись у великодушності нашого доброго вождя!]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Певно ж, обурено вигукував він, махаючи хвостиком і підстрибуючи, вони не думають, щоб на таке був здатний їхній улюблений вождь товариш Наполеон?
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Я впевнений, — Піскун підстрибнув і заметляв хвостиком, — я впевнений, що ви дуже добре знаєте свого улюбленого Вождя, товариша Наполеона, який на таке не здатний.

source: The van had previously been the property of the knacker, and had been bought by the veterinary surgeon, who had not yet painted the old name out.
uk_1984_iryna_dybko_khutir_tvaryn: Мушу вам вияснити, що це ветеринар недавно купив отой віз і не встиг перемінити напис на возі колишнього власника — різника. Просто важко повірити, що між вами є ще такі нерозумні! Як можна сумніватись у великодушності нашого доброго вождя!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: фургон раніше належав живодерові, але потім його придбав ветеринар і не встиг зафарбувати старої назви.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Справді, фургон раніше належав шкуродеру, але його відкупив ветеринар, який просто не встиг зафарбувати написане.

source: And when Squealer went on to give further graphic details of Boxer’s death-bed, the admirable care he had received, and the expensive medicines for which Napoleon had paid without a thought as to the cost, their last doubts disappeared and the sorrow that they felt for their comrade’s death was tempered by the thought that at least he had died happy.
uk_1984_iryna_dybko_khutir_tvaryn: Таж ясно, що вождь не менше за вас переживав недугу Добрилова й не висилав би його на смерть. Хто посмів серед вас розповсюджувати такі злобні вістки, той, мабуть, співпрацює з Давидовичем. Ви ще таки не знаєте свого великого вождя, товариша Вісарйонова. Таж він не пожалів коштовних ліків, щоб тільки вилікували Добрилова. Це ж він наказав, аби хворим Добриловим опікувались найбільш старанно. О, так, це товариш Вісарйонов доручив відставити Добрилова до лікарні й дати йому опіку лікарів-ветеринарів. Вождь Вісарйонов і досі переживає втрату Добрилова! Останні пояснення щодо опіки в лікарні над Добриловим злагіднили в серцях тварин смуток і жаль за ним. Повірили, що загибаючи Добрилов мав вигоду та дбайливу опіку.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: А коли Пищик яскраво змалював останні хвилини Боксера, ту виняткову увагу до нього, ті ліки, за які платив Наполеон, хоч вони неймовірно дорогі, останні сумніви розвіялися. Скорботу за померлим тамувала думка, що він, принаймні, відійшов щасливим.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: А коли Пискун дорозповів про останні хвилини життя Боксера, як за ним чудово доглядали, давали дорогі ліки, на які товариш Наполеон не шкодував грошей, — їхні сумніви розвіялися, а скорбота, яка найшла на них через смерть товариша, пом’якшала від думки, що він, принаймні, помер щасливим.

source: Napoleon himself appeared at the meeting on the following Sunday morning and pronounced a short oration in Boxer’s honour.
uk_1984_iryna_dybko_khutir_tvaryn: Найближчої неділі після загину Добрилова прийшов Вісарйонов на мітинґ; у своїй похвальній промові передав свій жаль за Добриловим і запевнив усіх, що з великою пошаною згадуватиме його.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: На ранковому мітингу наступної неділі з'явився сам Наполеон і виголосив про Боксера коротку промову.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: На наступне недільне зібрання з’явився сам Наполеон і виголосив коротку промову, присвячену Боксеру.

source: It had not been possible, he said, to bring back their lamented comrade’s remains for interment on the farm, but he had ordered a large wreath to be made from the laurels in the farmhouse garden and sent down to be placed on Boxer’s grave.
uk_1984_iryna_dybko_khutir_tvaryn: Який жаль, що його тлінні останки не змогли привезти на хутір, щоб із належними почестями його поховати! А все ж він наказав, щоби свині поклали вінок з найкращих квітів на його гріб у Волгограді.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Не було як, казав він, привезти останки їхнього оплакуваного товариша і поховати на фермі, але він звелів із лавра в садку ферми зробити великий вінок й покласти Боксерові на могилу.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Він також зазначив, що немає змоги поховати на фермі останки їхнього дорогого, щиро оплакуваного товариша, але обіцяє, що на могилі Боксера лежатиме великий лавровий вінок.

source: And in a few days’ time the pigs intended to hold a memorial banquet in Boxer’s honour.
uk_1984_iryna_dybko_khutir_tvaryn: Також повідомив Вісарйонов, що за декілька днів свині запланували влаштувати поминальний бенкет саме в пошану Добрилова.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: За кілька днів свині планували бучну учту, щоб пом'янути Боксера.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Також через кілька днів свині мають намір влаштувати урочистості, присвячені його пам’яті.

source: Napoleon ended his speech with a reminder of Boxer’s two favourite maxims, “I will work harder” and “Comrade Napoleon is always right” — maxims, he said, which every animal would do well to adopt as his own.
uk_1984_iryna_dybko_khutir_tvaryn: Свою промову закінчив Вісарйонов словами Добрилова: «Я працюватиму ще дужче і товариш Вісарйонов завжди правий!» Відтак порадив Вісарйонов, щоби з пошани до пом’яти Добрилова, кожна тварина присвоїла собі його слова у відношенні до праці й пошани до свого вождя, зокрема оті два останні речення, щоб стали кличем у щоденності життя тварин. Тоді Добрилов буде жити завжди з нами! — сказав він.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Завершив Наполеон промову двома улюбленими гаслами небіжчика: «Я працюватиму ще завзятіше» і «Товариш Наполеон завжди правий». Гасла ці варто б засвоїти кожній тварині, підкреслив він.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Наполеон закінчив свою промову, нагадавши присутнім два улюблених вислови Боксера: «Працюватиму більше» та «Товариш Наполеон завжди правий» — і наголосив, що їх слід засвоїти кожній тварині.

source: On the day appointed for the banquet, a grocer’s van drove up from Willingdon and delivered a large wooden crate at the farmhouse.
uk_1984_iryna_dybko_khutir_tvaryn: У визначений день поминального бенкету, приїхав з Волгограду на хутір віз. Що такого в ньому було, ніхто не зміг доглянути, бо закривала його повністю велика плахта.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: У день поминальної учти з Уїллінгдона приїхала підвода бакалійника й привезла великий дерев'яний ящик.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: У поминальний день на подвір’я підкотив великий фургон бакалійника, з якого вивантажили величезний дерев’яний ящик.

source: That night there was the sound of uproarious singing, which was followed by what sounded like a violent quarrel and ended at about eleven o’clock with a tremendous crash of glass.
uk_1984_iryna_dybko_khutir_tvaryn: Упродовж вечора й цілу ніч долітали з головного будинку до приміщень тварин голосні пісні. Відтак гучні пісні перейшли над ранок у сварку, що закінчилась брязкотом побитого скла.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тієї ночі розлягався оглушливий спів, а потім — щось схоже на несамовиту сварку, яка близько одинадцятої завершилася дзенькотом розбитого скла.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Увесь вечір з будинку линули пісні, потім почалася сварка й бійка, що закінчилася десь близько одинадцятої години гучним дзенькотом розбитого скла.

source: No one stirred in the farmhouse before noon on the following day, and the word went round that from somewhere or other the pigs had acquired the money to buy themselves another case of whisky.
uk_1984_iryna_dybko_khutir_tvaryn: Наступний день приніс тишу, а з головного будинку нікого не було видно. Пізніше тварини довідались, що якимось чином свині роздобули гроші, такі потрібні для купівлі приладдя, щоб полегшити працю в колгоспі, але ті гроші не призначили на приладдя, а закупили у Волгограді горілки; саме повні скрині її візник привіз учора на возі, вкритому плахтою.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Наступного дня до обіду будинок наче вимер, і пішла поголоска, що свині десь роздобули грошей на ще один ящик віскі.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: До дванадцятої години наступного дня ніхто й рила звідти не показав. Поширилися чутки, що свині знову роздобули десь грошей й купили собі ящик віскі.

source: Chapter X
uk_1984_iryna_dybko_khutir_tvaryn: X
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Розділ X

source: Years passed. The seasons came and went, the short animal lives fled by.
uk_1984_iryna_dybko_khutir_tvaryn: Пори року чергувались, роки минали й не одну тварину з хутора зі собою забирали...
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Минали роки. Приходила й відходила пора за порою, збігало недовге життя тварин.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Минали роки. Весну змінювало літо, а зима — осінь. Так само швидко закінчувалося коротке життя тварин.

source: A time came when there was no one who remembered the old days before the Rebellion, except Clover, Benjamin, Moses the raven, and a number of the pigs.
uk_1984_iryna_dybko_khutir_tvaryn: Прийшов той час, що вже не залишилось багато з-поміж тих тварин, які пам’ятали б життя на хуторі перед революцією, хібащо Молчазніков, Конева, ворон Мойсєєвич та декілька свиней.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: І от уже не лишилося тих, хто пам'ятав давноминулі дні перед Повстанням, окрім Конюшинки, Бенджаміна, ворона Мойсея та кількох свиней.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: І от настав час, коли не залишилося нікого, хто пам’ятав би, як їм велося до Повстання, окрім Люцерни, Бенджаміна, ворона Мозеса та кількох свиней.

source: Muriel was dead; Bluebell, Jessie, and Pincher were dead.
uk_1984_iryna_dybko_khutir_tvaryn: Коза Мурка згинула і пси Белов, Джесов, Пінков також відійшли.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Здохла Мюріел. Здохли Квітка, Джессі та Пінчер.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Мюріель давно здохла. Не стало Блюбелл, Джессі й Пінчер.

source: Jones too was dead — he had died in an inebriates’ home in another part of the country.
uk_1984_iryna_dybko_khutir_tvaryn: Хтось доніс, що й Романов помер десь у старечому домі на другому кінці країни.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Не стало й Джонса — він завершив свої дні в притулку для п'яниць у іншій частині країни.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Помер і Джонс десь у притулку.

source: Snowball was forgotten.
uk_1984_iryna_dybko_khutir_tvaryn: Давидовича давно вже призабули,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Забувся Сніжок.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Про Сніжка ніхто не згадував.

source: Boxer was forgotten, except by the few who had known him.
uk_1984_iryna_dybko_khutir_tvaryn: а Добрилова, крім Коневої й Молчазнікова, ніхто вже й не згадував.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Забули Боксера, окрім хіба тих, що знали його.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Боксера пам’ятали лише кілька його друзів.

source: Clover was an old stout mare now, stiff in the joints and with a tendency to rheumy eyes.
uk_1984_iryna_dybko_khutir_tvaryn: Познаки пізньої старости виявляла й Конева; її кості ламав ревматизм, очі постійно сльозили.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Конюшинка стала старою товстою кобилою з закостенілими кінцівками і сльозавими очима.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Люцерна стала старою малорухливою кобилою з розпухлими суглобами та сльозавими очима.

source: She was two years past the retiring age, but in fact no animal had ever actually retired.
uk_1984_iryna_dybko_khutir_tvaryn: Вже минуло два роки, як їй належалось відійти на пенсію, але ніхто й не згадував про те, а вона терпеливо ждала і хоч-не-хоч виходила на працю в колгоспі.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Вже два роки, як вона досягла пенсійного віку, проте жодна тварина так ніколи й не пішла на пенсію.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Вона мала вийти на пенсію два роки тому, але нікому з тварин цього зробити ще не вдавалося.

source: The talk of setting aside a corner of the pasture for superannuated animals had long since been dropped.
uk_1984_iryna_dybko_khutir_tvaryn: До речі, ні одне із тварин належного пенсійного віку, не діждалось відпочинку на приобіцяному клаптику пасовиська; хоч і про нього колись по революції говорили, та про пляни наділення цього клаптика пенсіонерам Вісарйонов призабув.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Давно не точилося розмов про те, щоб відгородити для перестарілих тварин шмат пасовиська.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Навіть розмови про відділення шматка пасовиська для пенсіонерів припинилися.

source: Napoleon was now a mature boar of twenty-four stone.
uk_1984_iryna_dybko_khutir_tvaryn: Вождь Вісарйонов був уже дорослим кабаном,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Наполеон був тепер зрілим кнуром, на півтора центнера.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Наполеон вступив у пору зрілості, нагулявши півтори сотні кілограмів.

source: Squealer was so fat that he could with difficulty see out of his eyes.
uk_1984_iryna_dybko_khutir_tvaryn: а Нікітов так потовстів, що міг тільки з не абияким зусиллям розплющувати очі.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Пищик так розповнів, що ледве бачив на очі.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: А Пискун розжирів так, що його очі геть позапливали.

source: Only old Benjamin was much the same as ever, except for being a little greyer about the muzzle, and, since Boxer’s death, more morose and taciturn than ever.
uk_1984_iryna_dybko_khutir_tvaryn: Один Молчазніков не змінився, немов над ним і час сили не мав, чи може щадив його...? Проте, від смерти Добрилова він став ще більш непривітним і мовчазним. Крім Коневої, він ні з ким не вітався. Проходив біля свиней і кабанів, недобачаючи їх.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Лише старий Бенджамін не змінився, хіба що навколо морди ще більше посивіло; від смерті Боксера він спохмурнів ще більше.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Лише старий Бенджамін майже не змінився, тільки посивів трохи та з часу смерті Боксера став ще відлюдькуватішим.

source: There were many more creatures on the farm now, though the increase was not so great as had been expected in earlier years.
uk_1984_iryna_dybko_khutir_tvaryn: Кількість тварин на хуторі збільшилася.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тепер ферма налічувала куди більше живності, хоч приріст був не такий, як очікувалося.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Тим часом Колгосп прибував населенням, хоч і не в тій кількості, як очікувалося колись.

source: Many animals had been born to whom the Rebellion was only a dim tradition, passed on by word of mouth, and others had been bought who had never heard mention of such a thing before their arrival.
uk_1984_iryna_dybko_khutir_tvaryn: Багато тварин народилось після революції. Подія революції для них була лише далекою історією, переказуваною на мітингах. А тварини, що їх купили, навіть і не чували про революцію, доки не прибули сюди й тут уже довідались про неї.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Народилося багато тварин, для яких Повстання було невиразною легендою, що передавалася з вуст у вуста. А інші, куплені, про це навіть і не чували.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: На світ з’явилося багато тварин, для яких Повстання було лише легендою, про нього лише ходили чутки. А ті тварини, яких купили, взагалі про нього не чули.

source: The farm possessed three horses now besides Clover.
uk_1984_iryna_dybko_khutir_tvaryn: Крім Коневої, було ще троє молодих коней
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тепер на фермі, окрім Конюшинки, завелося ще троє коней.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Окрім Люцерни в колгоспі було ще троє коней.

source: They were fine upstanding beasts, willing workers and good comrades, but very stupid.
uk_1984_iryna_dybko_khutir_tvaryn: здорових, охочих до праці, добрих товаришів за законами тваринізму, тільки безнадійно дурних,
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Хороші й кремезні, сумлінні трудівники й непогані друзі, але надто вже тупі,
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Добрі працівники, але надто вже дурні.

source: None of them proved able to learn the alphabet beyond the letter B.
uk_1984_iryna_dybko_khutir_tvaryn: їхні обмежені уми не були спроможні вивчити азбуки поза букву «Б».
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: бо жоден не спромігся вивчити абетку далі літери Б.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Ніхто з них не зміг просунутися в алфавіті далі букви Б.

source: They accepted everything that they were told about the Rebellion and the principles of Animalism, especially from Clover, for whom they had an almost filial respect; but it was doubtful whether they understood very much of it.
uk_1984_iryna_dybko_khutir_tvaryn: Молоді коні радо приймали всі накази Вісарйонова і його пояснювання революції й законів тваринізму. Та найбільше любили слухати Коневу; правда, були поважні причини сумніватися, скільки із прослуханого зрозуміли вони, бо вираз обличчя говорив, що очі шукають за доброю пашою...
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Вони визнавали все, що чули про Повстання й засади тваринизму, особливо від Конюшинки, яку майже по-синівському шанували, хоч і навряд щоб багато з того збагнули.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Вони приймали на віру все, що розповідали їм і про Повстання, і про засади Тваринізму, особливо, коли це говорила Люцерна, проте брали сумніви, чи розуміли вони хоч щось з того.

source: The farm was more prosperous now, and better organised: it had even been enlarged by two fields which had been bought from Mr. Pilkington.
uk_1984_iryna_dybko_khutir_tvaryn: Хутір уже під цю пору був багатіший, краще зорганізований, також обсягом поширений, бо аж два куски поля закупили від Пілсутова.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тепер ферма стала заможнішою і краще організованою: її навіть побільшало на два лани, викуплених у містера Пілкінгтона.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Колгосп виробляв тепер набагато більше продуктів, ніж раніше, і був краще організований. Його територія розширилася: дві ділянки викупили в містера Пілкінгтона.

source: The windmill had been successfully completed at last, and the farm possessed a threshing machine and a hay elevator of its own, and various new buildings had been added to it.
uk_1984_iryna_dybko_khutir_tvaryn: Будову вітряка нарешті закінчили. Придбали й машину для мелення соломи, багато нових будинків добудували.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Вітряк нарешті успішно завершили, мали молотарку й свій сіноелеватор, а також різні нові будівлі.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Будівництво млина нарешті успішно завершили, придбали молотарку й сінокосарку, побудували кілька нових приміщень.

source: The windmill, however, had not after all been used for generating electrical power. It was used for milling corn, and brought in a handsome money profit.
uk_1984_iryna_dybko_khutir_tvaryn: Хоч вітряк і не випродуковував електрики, як це Давидович планував, але молов зерно, а це влегшувало працю тваринам і приносило добрий заробіток.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Проте вітряк не виробляв електроенергію, а молов зерно на борошно, з чого мали неабиякий прибуток.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Утім, вітряк так і не давав електро­енергії, його використовували лише, щоб молоти зерно, а це приносило неабиякий прибуток.
